app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My first Article"], ["body", "This is the content for first article"], ["created_at", "2020-08-08 14:29:25.622145"], ["updated_at", "2020-08-08 14:29:25.622145"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    @article.save